<%@ page contentType="text/html;charset=UTF8"%>
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8" />
    <meta content="text/html; charset=utf-8" http-equiv="content-type" />
    <title>xBoson Install</title>
    <style type="text/css">
      <%@ include file="install.css" %>
      #right_text {
        height: 40%;
        width: 95%;
        min-height: 100px;
        max-height: 300px;
        overflow-y: scroll;
        overflow-x: hidden;
        word-wrap: break-word;
      }
      pre {
        width: 100%;
        word-wrap: break-word;
        white-space: pre-wrap;
      }
      form {
        margin-top: 10px;
      }
    </style>
    <script><%@ include file="jquery-2.1.4.min.js" %></script>
    <script><%@ include file="install.js" %></script>
    <%! com.xboson.been.Config c; %>
    <% c =  (com.xboson.been.Config) request.getAttribute("config"); %>
  </head>

  <body>
    <div id='contentdiv'>
      <div id='left'>
        <h1>版权信息</h1>
      </div>

      <div id='right'>
        <h2>xBoson 大数据平台, 版权信息</h2>

        <section id='right_text'><pre>
请务必认真阅读和理解本《 用户服务协议》（ 以下简称《 协议》） 中规定的所有权利和限制。 除非您接受本《 协议》 条款， 否则您无权注册、 登录或使用本协议所涉及的相关服务。 您一旦注册、 登录、 使用或以任何方式使用本《 协议》 所涉及的相关服务的行为将视为对本《 协议》 的接受， 即表示您同意接受本《 协议》 各项条款的约束。 如果您不同意本《 协议》 中的条款， 请不要注册、 登录或使用本《 协议》 相关服务。 本《 协议》 是用户与云平台之间的法律协议。

1. 接受
本协议内容包括协议正文以及所有云平台已经发布或将来发布的各类规则（ 包括但不限于法律声明、 隐私条款等）。 所有规则为本协议不可分割的一部分， 与本协议正文具有同等法律效力。
以任何方式进入云平台并使用“ 服务” 即表示您已经阅读本协议并同意与云平台订立本协议， 且您将受本协议的条款和条件(下称“ 条款”) 的约束。 本协议在必要时将随时进行修改更新， 每次改动都会在云平台上刊载公告， 通知予您。 如您不同意相关变更， 必须停止使用“ 服务”。 经修订的“ 条款” 一经在云平台公布后， 立即自动生效。 您登录或继续使用“ 服务” 即表示您已阅读并接受经修订的协议。
当您与云平台平台发生争议时， 应以最新的条款为准。 除另行明确声明外， 任何使“ 服务” 范围扩大或功能增强的新内容均受本协议约束。

2. 服务对象
“ 服务” 仅供能够完全民事行为能力的民事主体， 具有达成合约履行其义务的能力个人或公司使用。 若您不具备此资格， 请不要使用云平台提供的服务。
云平台有权根据实际情况随时调整服务内容， 并无需对任何人或第三方负责。

3. 会员帐号和保密
在使用本服务前， 您必须先行注册， 取得本公司提供给您的帐号。 您须对您的会员注册手机号、电子邮箱和密码负责， 您保证不向云平台工作人员以及其他任何人泄露该帐号及密码， 亦不使用其他任何人的帐号及密码。 只有您本人或您的合法授权人员可以使用您的帐号， 该帐号不可转让、 不可赠与、 不可继承。 在您决定不再使用该帐号时， 您应向本公司申请注销该帐号。
本公司通过您的手机号和密码识别您的指示， 请您妥善保管您的手机号和密码， 对于因密码泄露所致的损失， 由您自行承担。

您同意：
1) 如发现任何人未经授权使用您的手机号或密码， 或发生违反保密规定的任何其他情况， 您会立即通知云平台；
2) 确保您在每个上网时段结束时， 以正确步骤离开网站， 避免因您选择自动登录而导致帐号被非法使用。云平台无需且也不会对因您未能遵守本款规定而发生的任何损失或损毁负责。
3) 在您确认密码丢失时， 向云平台工作人员申请重置密码。
4. 费用

在您使用本服务时， 本公司有权依照云平台服务收费规则相应的服务收费介绍、 订单及 / 或相关协议向您收取服务费用。 具体服务费用以您使用本服务时本网站上所列之收费方式公告或您与本公司达成的其他书面协议为准。
本公司拥有制订及调整服务费、 支付条件之权利， 但至少提前30天的时间发出通知或公告，云平台将以网络公示和 / 或电信等方式通知。 账户欠费的情况下，云平台有权暂停或终止相应地收费服务， 并将终止该账户与服务的连接。

5. 注册义务
根据会员注册页面提示， 输入正确的手机号或电子邮箱和密码， 完成注册， 保证云平台可以通过您所填写的联系方式与您取得联系。 您承诺将及时更新您的会员资料以维持该等信息的有效性。
在您注册成为云平台用户时， 您授权本公司可以通过向第三者审核您的身份和资格， 并取得您使用本服务的相关资料。 倘若您提供的资料或信息包含有不正确、 不真实的信息，“ 智云” 平台将保留取消您会员资格并随时结束为您提供服务的权利。
您在云平台进行软件许可使用或服务应用过程中应遵守以下条款：

1) 遵守诚实信用的原则， 遵守当地及中国有关法律法规的规定； 不得利用该网站进行任何非法活动； 遵守所有与使用该网站有关的协议、 规定、 程序和惯例； 不发布各类违法或违规信息； 不在“ 智云” 平台上恶意评价其他用户；
2) 同意接收来自云平台及其合作伙伴发出的短信信息；
3) 对由于您在使用云平台服务的过程中， 违反本协议或通过提及而纳入本协议的条款和规则或帐号违反任何法律或第三方的权利而产生或引起的任何索赔、 要求、 诉讼、 损失和损害而言， 无论是已知或未知的， 包括合理的律师费， 您明确同意就此对云平台进行补偿并使其免受损害。
6. 服务期限

您的订单提交并完成费用支付之日起， 为您所购买应用的服务期限起始日期； 所购买应用到期日， 为应用服务期限结束时间。 某一应用服务期届满前， 您可按“ 智云” 平台公布的最新的服务说明继续购买使用此服务。

7. 服务的终止
您同意， 在下列情况下，云平台有权在发出通知或不发出通知的情况下， 可立即发出警告， 随时停止提供“ 服务” 或其任何部分：
1） 违反了此协议或已在约定范围内的任一条款；
2） 根据此协议相关说明而终止服务；
3） 本协议终止或更新时， 明示不愿接受新的服务协议的；
4） 无法核实或鉴定您向本公司提供的任何资料；
5） 其它任何违反互联网相关法律法规的信息或“ 智云”
平台认为需终止服务的情况。
服务终止后，云平台没有义务为用户保留原帐号中或与之相关的信息， 或转发未曾阅读或发送的信息给用户或第三方。

无论因任何原因以任何方式终止服务，云平台仍有权：
1） 保存或不保存该用户的注册数据及以前的交易行为记录；
2） 对于用户在服务终止前实施的违法或违约行为，云平台保留追索。 此外， 您同意，云平台不会就终止您接入“ 服务” 而对您或任何第三者承担任何责任。

8. 服务的提供
本公司会尽一切努力为您提供最优质的服务， 本公司保留在无须发出书面通知， 仅在云平台公示的情况下， 暂时或永久地更改或停止部分或全部“ 服务” 的权利。 对于“ 智云” 平台行使修改或中断服务的权利而造成损失的，” 智云” 平台不需对用户或任何第三方负责。
本公司有权修改或变更所提供的收费服务、 收费标准、 收费方式、 服务费及服务条款。云平台在提供服务时， 可能现在或日后对部分服务的用户开始收取一定的费用， 如用户拒绝支付该等费用， 则不能在收费开始后继续使用相关的服务。 但云平台将尽最大努力通过电邮或其他有效方式通知用户有关的修改或变更。
本公司会定期或不定期的对提供网络服务的平台和相关的设备进行检修或者维护。 本公司不能随时预见到任何技术上的问题或其他困难。 该等困难可能会导致数据损失或其他服务中断。 为此， 您明确理解和同意， 您使用“ 服务” 的风险由您自行承担。

9. 责任限制
您明确理解和同意， 本公司不对因下述任一情况而导致的任何损害赔偿承担责任， 包括但不限于利润、 商誉、 使用、 数据等方面的损失或其它无形损失的损害赔偿(无论本公司是否已被告知该等损害赔偿的可能性)：
1） 使用或未能使用“ 服务”；
2） 第三方未经批准的接入或第三方更改用户的传输数据；
3） 任何第三方对“ 服务” 的声明或关于“ 服务” 的行为；
4） 或非因本公司的原因而引起的与“ 服务” 有关的任何其它事宜， 包括疏忽。
您明确理解并同意， 如因您违反有关法律或者本协议之规定， 使本公司遭受任何损失， 受到任何第三方的索赔， 或任何行政管理部门的处罚， 您应对本公司承担赔偿责任， 包括合理的律师费用。

10. 知识产权
云平台上所有内容， 包括但不限于著作、 图片、 档案、 资讯、 资料、 网站架构、 网站画面的安排、 网页设计， 均由本公司或其他权利人依法拥有其知识产权， 包括但不限于商标权、 专利权、 著作权、 商业秘密等。
非经本公司或其他权利人书面同意， 任何人不得擅自使用、 修改、 复制、 公开传播、 改变、 散布、 发行或公开发表本网站程序或内容。

11. 修改或转让
本公司有权随时修改本协议的任何条款， 且有权将本协议项下的权利及义务转让予第三方。 一旦本协议的任何内容发生变动， 本公司将会通过适当方式向用户提示修改内容。
如果您不同意本公司对本协议相关条款所做的修改及（ 或） 转让， 您有权停止使用网络服务。 若您继续使用网络服务， 则视为接受。

12. 通知
除非另有明确规定， 任何通知应以短信形式发送到您在登记过程中向云平台提供的手机号码， 在短信发出二十四(24) 小时后， 通知应被视为已送达， 除非发送人被告知相关手机号码已注销。

13. 不可抗力
对于因本公司合理控制范围以外的原因， 包括但不限于自然灾害、 罢工或骚乱、 物质短缺或定量配给、 暴动、 战争行为、 政府行为、 通讯或其他设施故障或严重伤亡事故等本公司不能预见、 不能避免且不能克服的情况， 致使本公司延迟或未能履约的，云平台可免于承担责任。

14. 争议解决
任何一方未履行本协议的约定均视为违约， 按合同法规定处理； 因本协议或云平台服务所引起或与其有关的任何争议， 双方应尽量友好协商解决， 协商不能解决时， 任何一方均可向本合同履行地及服务器所在地人民法院提起诉讼。

此协议适用中华人民共和国法律。 如与此协议有关的某一特定事项缺乏明确法律规定， 则应参照通用的国际商业惯例和行业惯例。

15. 违约责任

您应本着诚信的原则履行本协议的约定， 若您未能按照本协议约定支付相关款项的， 自逾期之日起按应付款金额日千分之五承担违约责任。

16. 其他规定

本协议构成您与云平台之全部协议， 并取代您和云平台先前就相同事项订立的任何书面或口头协议。 但在您使用相关服务、 或使用第三方提供的内容或软件时， 亦应遵从所适用之附加条款及权利。
如本协议任何规定被裁定为无效或不可强制执行， 该项规定应被撤销， 而其余条款仍应有效且具有约束力。
本公司未就您或其他人士的某项违约行为采取行动， 并不表明本公司撤回就任何继后或类似的违约事件采取行动的权利。
每项服务的内容、 收费标准、 收费方式、 服务费及服务条款应以最后发布的通知为准。
您对本协议的任何部分之意见及建议可通过客户服务部门与云平台联系。
        </pre></section>

        <form method="POST">
          <input type="hidden" name="next" value="1"/>

          <h6>接受协议中的条款</h6>

          <section>
            <input type='checkbox' name="copyright" value='yes'/>我接受本条款, 并受到法律约束.
            <br/><br/>
            <input type='submit' value='下一步'/>
            <span class="red"><%=request.getAttribute("msg") %></span>
          </section>
        </form>
      </div>

      <script>
      $("[name=copyright]").click(function() {
        $('#right_text').css('background-color', '#faa');
      });
      </script>

    </div>
  </body>
</html>